MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MKE04Z64VLK4/mcu.h
/*! @name PUE1 - Port Pullup Enable Register 1 */
/*! @{ */
#define PORT_PUE1_PTEPE0_MASK                    (0x1U)
#define PORT_PUE1_PTEPE0_SHIFT                   (0U)
/*! PTEPE0 - Pull Enable for Port E Bit 0
 *  0b0..Pullup is disabled for port E bit 0.
 *  0b1..Pullup is enabled for port E bit 0.
 */
#define PORT_PUE1_PTEPE0(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE1_PTEPE0_SHIFT)) & PORT_PUE1_PTEPE0_MASK)
#define PORT_PUE1_PTEPE1_MASK                    (0x2U)
#define PORT_PUE1_PTEPE1_SHIFT                   (1U)
/*! PTEPE1 - Pull Enable for Port E Bit 1
 *  0b0..Pullup is disabled for port E bit 1.
 *  0b1..Pullup is enabled for port E bit 1.
 */
#define PORT_PUE1_PTEPE1(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE1_PTEPE1_SHIFT)) & PORT_PUE1_PTEPE1_MASK)
#define PORT_PUE1_PTEPE2_MASK                    (0x4U)
#define PORT_PUE1_PTEPE2_SHIFT                   (2U)
/*! PTEPE2 - Pull Enable for Port E Bit 2
 *  0b0..Pullup is disabled for port E bit 2.
 *  0b1..Pullup is enabled for port E bit 2.
 */
#define PORT_PUE1_PTEPE2(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE1_PTEPE2_SHIFT)) & PORT_PUE1_PTEPE2_MASK)
#define PORT_PUE1_PTEPE3_MASK                    (0x8U)
#define PORT_PUE1_PTEPE3_SHIFT                   (3U)
/*! PTEPE3 - Pull Enable for Port E Bit 3
 *  0b0..Pullup is disabled for port E bit 3.
 *  0b1..Pullup is enabled for port E bit 3.
 */
#define PORT_PUE1_PTEPE3(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE1_PTEPE3_SHIFT)) & PORT_PUE1_PTEPE3_MASK)
#define PORT_PUE1_PTEPE4_MASK                    (0x10U)
#define PORT_PUE1_PTEPE4_SHIFT                   (4U)
/*! PTEPE4 - Pull Enable for Port E Bit 4
 *  0b0..Pullup is disabled for port E bit 4.
 *  0b1..Pullup is enabled for port E bit 4.
 */
#define PORT_PUE1_PTEPE4(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE1_PTEPE4_SHIFT)) & PORT_PUE1_PTEPE4_MASK)
#define PORT_PUE1_PTEPE5_MASK                    (0x20U)
#define PORT_PUE1_PTEPE5_SHIFT                   (5U)
/*! PTEPE5 - Pull Enable for Port E Bit 5
 *  0b0..Pullup is disabled for port E bit 5.
 *  0b1..Pullup is enabled for port E bit 5.
 */
#define PORT_PUE1_PTEPE5(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE1_PTEPE5_SHIFT)) & PORT_PUE1_PTEPE5_MASK)
#define PORT_PUE1_PTEPE6_MASK                    (0x40U)
#define PORT_PUE1_PTEPE6_SHIFT                   (6U)
/*! PTEPE6 - Pull Enable for Port E Bit 6
 *  0b0..Pullup is disabled for port E bit 6.
 *  0b1..Pullup is enabled for port E bit 6.
 */
#define PORT_PUE1_PTEPE6(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE1_PTEPE6_SHIFT)) & PORT_PUE1_PTEPE6_MASK)
#define PORT_PUE1_PTEPE7_MASK                    (0x80U)
#define PORT_PUE1_PTEPE7_SHIFT                   (7U)
/*! PTEPE7 - Pull Enable for Port E Bit 7
 *  0b0..Pullup is disabled for port E bit 7.
 *  0b1..Pullup is enabled for port E bit 7.
 */
#define PORT_PUE1_PTEPE7(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE1_PTEPE7_SHIFT)) & PORT_PUE1_PTEPE7_MASK)
#define PORT_PUE1_PTFPE0_MASK                    (0x100U)
#define PORT_PUE1_PTFPE0_SHIFT                   (8U)
/*! PTFPE0 - Pull Enable for Port F Bit 0
 *  0b0..Pullup is disabled for port F bit 0.
 *  0b1..Pullup is enabled for port F bit 0.
 */
#define PORT_PUE1_PTFPE0(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE1_PTFPE0_SHIFT)) & PORT_PUE1_PTFPE0_MASK)
#define PORT_PUE1_PTFPE1_MASK                    (0x200U)
#define PORT_PUE1_PTFPE1_SHIFT                   (9U)
/*! PTFPE1 - Pull Enable for Port F Bit 1
 *  0b0..Pullup is disabled for port F bit 1.
 *  0b1..Pullup is enabled for port F bit 1.
 */
#define PORT_PUE1_PTFPE1(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE1_PTFPE1_SHIFT)) & PORT_PUE1_PTFPE1_MASK)
#define PORT_PUE1_PTFPE2_MASK                    (0x400U)
#define PORT_PUE1_PTFPE2_SHIFT                   (10U)
/*! PTFPE2 - Pull Enable for Port F Bit 2
 *  0b0..Pullup is disabled for port F bit 2.
 *  0b1..Pullup is enabled for port F bit 2.
 */
#define PORT_PUE1_PTFPE2(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE1_PTFPE2_SHIFT)) & PORT_PUE1_PTFPE2_MASK)
#define PORT_PUE1_PTFPE3_MASK                    (0x800U)
#define PORT_PUE1_PTFPE3_SHIFT                   (11U)
/*! PTFPE3 - Pull Enable for Port F Bit 3
 *  0b0..Pullup is disabled for port F bit 3.
 *  0b1..Pullup is enabled for port F bit 3.
 */
#define PORT_PUE1_PTFPE3(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE1_PTFPE3_SHIFT)) & PORT_PUE1_PTFPE3_MASK)
#define PORT_PUE1_PTFPE4_MASK                    (0x1000U)
#define PORT_PUE1_PTFPE4_SHIFT                   (12U)
/*! PTFPE4 - Pull Enable for Port F Bit 4
 *  0b0..Pullup is disabled for port F bit 4.
 *  0b1..Pullup is enabled for port F bit 4.
 */
#define PORT_PUE1_PTFPE4(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE1_PTFPE4_SHIFT)) & PORT_PUE1_PTFPE4_MASK)
#define PORT_PUE1_PTFPE5_MASK                    (0x2000U)
#define PORT_PUE1_PTFPE5_SHIFT                   (13U)
/*! PTFPE5 - Pull Enable for Port F Bit 5
 *  0b0..Pullup is disabled for port F bit 5.
 *  0b1..Pullup is enabled for port F bit 5.
 */
#define PORT_PUE1_PTFPE5(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE1_PTFPE5_SHIFT)) & PORT_PUE1_PTFPE5_MASK)
#define PORT_PUE1_PTFPE6_MASK                    (0x4000U)
#define PORT_PUE1_PTFPE6_SHIFT                   (14U)
/*! PTFPE6 - Pull Enable for Port F Bit 6
 *  0b0..Pullup is disabled for port F bit 6.
 *  0b1..Pullup is enabled for port F bit 6.
 */
#define PORT_PUE1_PTFPE6(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE1_PTFPE6_SHIFT)) & PORT_PUE1_PTFPE6_MASK)
#define PORT_PUE1_PTFPE7_MASK                    (0x8000U)
#define PORT_PUE1_PTFPE7_SHIFT                   (15U)
/*! PTFPE7 - Pull Enable for Port F Bit 7
 *  0b0..Pullup is disabled for port F bit 7.
 *  0b1..Pullup is enabled for port F bit 7.
 */
#define PORT_PUE1_PTFPE7(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE1_PTFPE7_SHIFT)) & PORT_PUE1_PTFPE7_MASK)
#define PORT_PUE1_PTGPE0_MASK                    (0x10000U)
#define PORT_PUE1_PTGPE0_SHIFT                   (16U)
/*! PTGPE0 - Pull Enable for Port G Bit 0
 *  0b0..Pullup is disabled for port G bit 0.
 *  0b1..Pullup is enabled for port G bit 0.
 */
#define PORT_PUE1_PTGPE0(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE1_PTGPE0_SHIFT)) & PORT_PUE1_PTGPE0_MASK)
#define PORT_PUE1_PTGPE1_MASK                    (0x20000U)
#define PORT_PUE1_PTGPE1_SHIFT                   (17U)
/*! PTGPE1 - Pull Enable for Port G Bit 1
 *  0b0..Pullup is disabled for port G bit 1.
 *  0b1..Pullup is enabled for port G bit 1.
 */
#define PORT_PUE1_PTGPE1(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE1_PTGPE1_SHIFT)) & PORT_PUE1_PTGPE1_MASK)
#define PORT_PUE1_PTGPE2_MASK                    (0x40000U)
#define PORT_PUE1_PTGPE2_SHIFT                   (18U)
/*! PTGPE2 - Pull Enable for Port G Bit 2
 *  0b0..Pullup is disabled for port G bit 2.
 *  0b1..Pullup is enabled for port G bit 2.
 */
#define PORT_PUE1_PTGPE2(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE1_PTGPE2_SHIFT)) & PORT_PUE1_PTGPE2_MASK)
#define PORT_PUE1_PTGPE3_MASK                    (0x80000U)
#define PORT_PUE1_PTGPE3_SHIFT                   (19U)
/*! PTGPE3 - Pull Enable for Port G Bit 3
 *  0b0..Pullup is disabled for port G bit 3.
 *  0b1..Pullup is enabled for port G bit 3.
 */
#define PORT_PUE1_PTGPE3(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE1_PTGPE3_SHIFT)) & PORT_PUE1_PTGPE3_MASK)
#define PORT_PUE1_PTGPE4_MASK                    (0x100000U)
#define PORT_PUE1_PTGPE4_SHIFT                   (20U)
/*! PTGPE4 - Pull Enable for Port G Bit 4
 *  0b0..Pullup is disabled for port G bit 4.
 *  0b1..Pullup is enabled for port G bit 4.
 */
#define PORT_PUE1_PTGPE4(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE1_PTGPE4_SHIFT)) & PORT_PUE1_PTGPE4_MASK)
#define PORT_PUE1_PTGPE5_MASK                    (0x200000U)
#define PORT_PUE1_PTGPE5_SHIFT                   (21U)
/*! PTGPE5 - Pull Enable for Port G Bit 5
 *  0b0..Pullup is disabled for port G bit 5.
 *  0b1..Pullup is enabled for port G bit 5.
 */
#define PORT_PUE1_PTGPE5(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE1_PTGPE5_SHIFT)) & PORT_PUE1_PTGPE5_MASK)
#define PORT_PUE1_PTGPE6_MASK                    (0x400000U)
#define PORT_PUE1_PTGPE6_SHIFT                   (22U)
/*! PTGPE6 - Pull Enable for Port G Bit 6
 *  0b0..Pullup is disabled for port G bit 6.
 *  0b1..Pullup is enabled for port G bit 6.
 */
#define PORT_PUE1_PTGPE6(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE1_PTGPE6_SHIFT)) & PORT_PUE1_PTGPE6_MASK)
#define PORT_PUE1_PTGPE7_MASK                    (0x800000U)
#define PORT_PUE1_PTGPE7_SHIFT                   (23U)
/*! PTGPE7 - Pull Enable for Port G Bit 7
 *  0b0..Pullup is disabled for port G bit 7.
 *  0b1..Pullup is enabled for port G bit 7.
 */
#define PORT_PUE1_PTGPE7(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE1_PTGPE7_SHIFT)) & PORT_PUE1_PTGPE7_MASK)
#define PORT_PUE1_PTHPE0_MASK                    (0x1000000U)
#define PORT_PUE1_PTHPE0_SHIFT                   (24U)
/*! PTHPE0 - Pull Enable for Port H Bit 0
 *  0b0..Pullup is disabled for port H bit 0.
 *  0b1..Pullup is enabled for port H bit 0.
 */
#define PORT_PUE1_PTHPE0(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE1_PTHPE0_SHIFT)) & PORT_PUE1_PTHPE0_MASK)
#define PORT_PUE1_PTHPE1_MASK                    (0x2000000U)
#define PORT_PUE1_PTHPE1_SHIFT                   (25U)
/*! PTHPE1 - Pull Enable for Port H Bit 1
 *  0b0..Pullup is disabled for port H bit 1.
 *  0b1..Pullup is enabled for port H bit 1.
 */
#define PORT_PUE1_PTHPE1(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE1_PTHPE1_SHIFT)) & PORT_PUE1_PTHPE1_MASK)
#define PORT_PUE1_PTHPE2_MASK                    (0x4000000U)
#define PORT_PUE1_PTHPE2_SHIFT                   (26U)
/*! PTHPE2 - Pull Enable for Port H Bit 2
 *  0b0..Pullup is disabled for port H bit 2.
 *  0b1..Pullup is enabled for port H bit 2.
 */
#define PORT_PUE1_PTHPE2(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE1_PTHPE2_SHIFT)) & PORT_PUE1_PTHPE2_MASK)
#define PORT_PUE1_PTHPE3_MASK                    (0x8000000U)
#define PORT_PUE1_PTHPE3_SHIFT                   (27U)
/*! PTHPE3 - Pull Enable for Port H Bit 3
 *  0b0..Pullup is disabled for port H bit 3.
 *  0b1..Pullup is enabled for port H bit 3.
 */
#define PORT_PUE1_PTHPE3(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE1_PTHPE3_SHIFT)) & PORT_PUE1_PTHPE3_MASK)
#define PORT_PUE1_PTHPE4_MASK                    (0x10000000U)
#define PORT_PUE1_PTHPE4_SHIFT                   (28U)
/*! PTHPE4 - Pull Enable for Port H Bit 4
 *  0b0..Pullup is disabled for port H bit 4.
 *  0b1..Pullup is enabled for port H bit 4.
 */
#define PORT_PUE1_PTHPE4(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE1_PTHPE4_SHIFT)) & PORT_PUE1_PTHPE4_MASK)
#define PORT_PUE1_PTHPE5_MASK                    (0x20000000U)
#define PORT_PUE1_PTHPE5_SHIFT                   (29U)
/*! PTHPE5 - Pull Enable for Port H Bit 5
 *  0b0..Pullup is disabled for port H bit 5.
 *  0b1..Pullup is enabled for port H bit 5.
 */
#define PORT_PUE1_PTHPE5(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE1_PTHPE5_SHIFT)) & PORT_PUE1_PTHPE5_MASK)
#define PORT_PUE1_PTHPE6_MASK                    (0x40000000U)
#define PORT_PUE1_PTHPE6_SHIFT                   (30U)
/*! PTHPE6 - Pull Enable for Port H Bit 6
 *  0b0..Pullup is disabled for port H bit 6.
 *  0b1..Pullup is enabled for port H bit 6.
 */
#define PORT_PUE1_PTHPE6(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE1_PTHPE6_SHIFT)) & PORT_PUE1_PTHPE6_MASK)
#define PORT_PUE1_PTHPE7_MASK                    (0x80000000U)
#define PORT_PUE1_PTHPE7_SHIFT                   (31U)
/*! PTHPE7 - Pull Enable for Port H Bit 7
 *  0b0..Pullup is disabled for port H bit 7.
 *  0b1..Pullup is enabled for port H bit 7.
 */
#define PORT_PUE1_PTHPE7(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE1_PTHPE7_SHIFT)) & PORT_PUE1_PTHPE7_MASK)
/*! @} */

/*! @name PUE2 - Port Pullup Enable Register 2 */
/*! @{ */
#define PORT_PUE2_PTIPE0_MASK                    (0x1U)
#define PORT_PUE2_PTIPE0_SHIFT                   (0U)
/*! PTIPE0 - Pull Enable for Port I Bit 0
 *  0b0..Pullup is disabled for port I bit 0.
 *  0b1..Pullup is enabled for port I bit 0.
 */
#define PORT_PUE2_PTIPE0(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE2_PTIPE0_SHIFT)) & PORT_PUE2_PTIPE0_MASK)
#define PORT_PUE2_PTIPE1_MASK                    (0x2U)
#define PORT_PUE2_PTIPE1_SHIFT                   (1U)
/*! PTIPE1 - Pull Enable for Port I Bit 1
 *  0b0..Pullup is disabled for port I bit 1.
 *  0b1..Pullup is enabled for port I bit 1.
 */
#define PORT_PUE2_PTIPE1(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE2_PTIPE1_SHIFT)) & PORT_PUE2_PTIPE1_MASK)
#define PORT_PUE2_PTIPE2_MASK                    (0x4U)
#define PORT_PUE2_PTIPE2_SHIFT                   (2U)
/*! PTIPE2 - Pull Enable for Port I Bit 2
 *  0b0..Pullup is disabled for port I bit 2.
 *  0b1..Pullup is enabled for port I bit 2.
 */
#define PORT_PUE2_PTIPE2(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE2_PTIPE2_SHIFT)) & PORT_PUE2_PTIPE2_MASK)
#define PORT_PUE2_PTIPE3_MASK                    (0x8U)
#define PORT_PUE2_PTIPE3_SHIFT                   (3U)
/*! PTIPE3 - Pull Enable for Port I Bit 3
 *  0b0..Pullup is disabled for port I bit 3.
 *  0b1..Pullup is enabled for port I bit 3.
 */
#define PORT_PUE2_PTIPE3(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE2_PTIPE3_SHIFT)) & PORT_PUE2_PTIPE3_MASK)
#define PORT_PUE2_PTIPE4_MASK                    (0x10U)
#define PORT_PUE2_PTIPE4_SHIFT                   (4U)
/*! PTIPE4 - Pull Enable for Port I Bit 4
 *  0b0..Pullup is disabled for port I bit 4.
 *  0b1..Pullup is enabled for port I bit 4.
 */
#define PORT_PUE2_PTIPE4(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE2_PTIPE4_SHIFT)) & PORT_PUE2_PTIPE4_MASK)
#define PORT_PUE2_PTIPE5_MASK                    (0x20U)
#define PORT_PUE2_PTIPE5_SHIFT                   (5U)
/*! PTIPE5 - Pull Enable for Port I Bit 5
 *  0b0..Pullup is disabled for port I bit 5.
 *  0b1..Pullup is enabled for port I bit 5.
 */
#define PORT_PUE2_PTIPE5(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE2_PTIPE5_SHIFT)) & PORT_PUE2_PTIPE5_MASK)
#define PORT_PUE2_PTIPE6_MASK                    (0x40U)
#define PORT_PUE2_PTIPE6_SHIFT                   (6U)
/*! PTIPE6 - Pull Enable for Port I Bit 6
 *  0b0..Pullup is disabled for port I bit 6.
 *  0b1..Pullup is enabled for port I bit 6.
 */
#define PORT_PUE2_PTIPE6(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE2_PTIPE6_SHIFT)) & PORT_PUE2_PTIPE6_MASK)
/*! @} */

/*! @name HDRVE - Port High Drive Enable Register */
/*! @{ */
#define PORT_HDRVE_PTB4_MASK                     (0x1U)
#define PORT_HDRVE_PTB4_SHIFT                    (0U)
/*! PTB4 - High Current Drive Capability of PTB4
 *  0b0..PTB4 is disabled to offer high current drive capability.
 *  0b1..PTB4 is enabled to offer high current drive capability.
 */
#define PORT_HDRVE_PTB4(x)                       (((uint32_t)(((uint32_t)(x)) << PORT_HDRVE_PTB4_SHIFT)) & PORT_HDRVE_PTB4_MASK)
#define PORT_HDRVE_PTB5_MASK                     (0x2U)
#define PORT_HDRVE_PTB5_SHIFT                    (1U)
/*! PTB5 - High Current Drive Capability of PTB5
 *  0b0..PTB5 is disabled to offer high current drive capability.
 *  0b1..PTB5 is enabled to offer high current drive capability.
 */
#define PORT_HDRVE_PTB5(x)                       (((uint32_t)(((uint32_t)(x)) << PORT_HDRVE_PTB5_SHIFT)) & PORT_HDRVE_PTB5_MASK)
#define PORT_HDRVE_PTD0_MASK                     (0x4U)
#define PORT_HDRVE_PTD0_SHIFT                    (2U)
/*! PTD0 - High Current Drive Capability of PTD0
 *  0b0..PTD0 is disabled to offer high current drive capability.
 *  0b1..PTD0 is enabled to offer high current drive capability.
 */
#define PORT_HDRVE_PTD0(x)                       (((uint32_t)(((uint32_t)(x)) << PORT_HDRVE_PTD0_SHIFT)) & PORT_HDRVE_PTD0_MASK)
#define PORT_HDRVE_PTD1_MASK                     (0x8U)
#define PORT_HDRVE_PTD1_SHIFT                    (3U)
/*! PTD1 - High Current Drive Capability of PTD1
 *  0b0..PTD1 is disabled to offer high current drive capability.
 *  0b1..PTD1 is enable to offer high current drive capability.
 */
#define PORT_HDRVE_PTD1(x)                       (((uint32_t)(((uint32_t)(x)) << PORT_HDRVE_PTD1_SHIFT)) & PORT_HDRVE_PTD1_MASK)
#define PORT_HDRVE_PTE0_MASK                     (0x10U)
#define PORT_HDRVE_PTE0_SHIFT                    (4U)
/*! PTE0 - High Current Drive Capability of PTE0
 *  0b0..PTE0 is disabled to offer high current drive capability.
 *  0b1..PTE0 is enable to offer high current drive capability.
 */
#define PORT_HDRVE_PTE0(x)                       (((uint32_t)(((uint32_t)(x)) << PORT_HDRVE_PTE0_SHIFT)) & PORT_HDRVE_PTE0_MASK)
#define PORT_HDRVE_PTE1_MASK                     (0x20U)
#define PORT_HDRVE_PTE1_SHIFT                    (5U)
/*! PTE1 - High Current Drive Capability of PTE1
 *  0b0..PTE1 is disabled to offer high current drive capability.
 *  0b1..PTE1 is enabled to offer high current drive capability.
 */
#define PORT_HDRVE_PTE1(x)                       (((uint32_t)(((uint32_t)(x)) << PORT_HDRVE_PTE1_SHIFT)) & PORT_HDRVE_PTE1_MASK)
#define PORT_HDRVE_PTH0_MASK                     (0x40U)
#define PORT_HDRVE_PTH0_SHIFT                    (6U)
/*! PTH0 - High Current Drive Capability of PTH0
 *  0b0..PTH0 is disabled to offer high current drive capability.
 *  0b1..PTH0 is enabled to offer high current drive capability.
 */
#define PORT_HDRVE_PTH0(x)                       (((uint32_t)(((uint32_t)(x)) << PORT_HDRVE_PTH0_SHIFT)) & PORT_HDRVE_PTH0_MASK)
#define PORT_HDRVE_PTH1_MASK                     (0x80U)
#define PORT_HDRVE_PTH1_SHIFT                    (7U)
/*! PTH1 - High Current Drive Capability of PTH1
 *  0b0..PTH1 is disabled to offer high current drive capability.
 *  0b1..PTH1 is enabled to offer high current drive capability.
 */
#define PORT_HDRVE_PTH1(x)                       (((uint32_t)(((uint32_t)(x)) << PORT_HDRVE_PTH1_SHIFT)) & PORT_HDRVE_PTH1_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group PORT_Register_Masks */


